ubuntu_ip.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>网络管理</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="网络管理"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu网络管理"/>
<meta name="keywords" content="Ubuntu ip MAC"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">网络管理</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 网络管理</a>
<ul>
<li><a href="#sec-1-1">1.1 查看当前IP地址</a></li>
<li><a href="#sec-1-2">1.2 查看当前外网的IP地址</a></li>
<li><a href="#sec-1-3">1.3 察看当前网卡的物理地址</a></li>
<li><a href="#sec-1-4">1.4 修改网卡MAC地址</a></li>
<li><a href="#sec-1-5">1.5 查看网络的当前流量</a></li>
</ul>
</li>
<li><a href="#sec-2">2 其它技巧</a>
<ul>
<li><a href="#sec-2-1">2.1 查看域名的注册备案情况</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 网络管理</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 查看当前IP地址</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">ifconfig eth0 |awk '/inet/ {split($2,x,":");print x[2]}'
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 查看当前外网的IP地址</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">w3m -no-cookie -dump www.ip138.com/ip2city.asp|grep -o '[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}'
w3m -no-cookie -dump ip.loveroot.com|grep -o '[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}'
curl ifconfig.me
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 察看当前网卡的物理地址</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">ifconfig eth0 | head -1 | awk '{print $5}'
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 修改网卡MAC地址</h3>
<div class="outline-text-3" id="text-1-4">





<pre class="example">sudo ifconfig eth0 down #关闭网卡
sudo ifconfig eth0 hw ether 00:AA:BB:CC:DD:EE #然后改地址
sudo ifconfig eth0 up #然后启动网卡
</pre>


<p>
    永久改地址方法
</p>



<pre class="example">sudo gedit /etc/network/interfaces
</pre>


<p>
    在 iface eth0 inet static 后面添加一行：
</p>



<pre class="example">pre-up ifconfig eth0 hw ether 01:01:01:01:01:01
</pre>



<p>    
    配置文件应该像如下
</p>



<pre class="example">iface eth0 inet static
pre-up ifconfig eth0 hw ether 01:01:01:01:01:01
address 192.168.1.10
netmask 255.255.255.0
gateway 192.168.1.1
</pre>


<p>    
    最后是 logout 或者reboot
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 查看网络的当前流量</h3>
<div class="outline-text-3" id="text-1-5">





<pre class="example">#安装 ethstatus 软件
sudo apt-get install ethstatus
#查看 ADSL 的速度
sudo ethstatus -i ppp0
#查看 网卡 的速度
sudo ethstatus -i eth0
#或安装 bwm-ng 
sudo apt-get install bwm-ng
#查看当前网络流量
bwm-ng
</pre>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 其它技巧</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 查看域名的注册备案情况</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">whois baidu.cn
</pre>






</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
